HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/InformationRegisters/ДБ_ПланыЗанятий/ДБ_ПланыЗанятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДБ_ПланыЗанятий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УченикГруппа</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗанятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/InformationRegisters/ДБ_ПланыЗанятий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ЗаписьРасписания(Занятие) Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Занятие.Период;
	МенеджерЗаписи.УченикГруппа = Занятие.Ученик;
	МенеджерЗаписи.ДатаЗанятия = Занятие.ДатаЗанятия;
	МенеджерЗаписи.Прочитать();
	Возврат МенеджерЗаписи;
КонецФункции

// Удалить занятие.
// 
// Параметры:
//  Занятие - Структура
//	* Ученик
Процедура УдалитьЗанятие(Занятие) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УченикГруппа.Установить(Занятие.Ученик);
	НаборЗаписей.Отбор.ДатаЗанятия.Установить(Занятие.ДатаЗанятия);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	ДБ_РаботаСКалендарем.УдалитьСобытие(Занятие.Идентификатор);
КонецПроцедуры

// Добавить занятие.
// 
// Параметры:
//  Занятие - Структура
//	* Ученик
Процедура ДобавитьЗанятие(Занятие) Экспорт
	ОписаниеСобытия = Занятие;
	ОписаниеСобытия.Вставить("Период", ТекущаяДатаСеанса());
	ЗаписьПланЗанятий = РегистрыСведений.ДБ_ПланыЗанятий.СоздатьМенеджерЗаписи();
	ЗаписьПланЗанятий.Период = ОписаниеСобытия.Период;
	ЗаписьПланЗанятий.УченикГруппа = Занятие.Ученик;
	ЗаписьПланЗанятий.ДатаЗанятия = Занятие.ДатаЗанятия;
	ЗаписьПланЗанятий.КоличествоЧасов = Занятие.КоличествоЧасов;
	ЗаписьПланЗанятий.ВремяПроведения = ДБ_РаботаСКалендарем.ПреобразоватьАкадемическиеЧасыВАстрономические(
			ЗаписьПланЗанятий.КоличествоЧасов);
	ЗаписьПланЗанятий.ДатаНачала = ЗаписьПланЗанятий.ДатаЗанятия + (Занятие.ВремяНачала - Дата(1, 1, 1));
	ЗаписьПланЗанятий.ДатаОкончания = ЗаписьПланЗанятий.ДатаНачала + (ЗаписьПланЗанятий.ВремяПроведения - Дата(1, 1, 1));
	ЗаписьПланЗанятий.Записать();
	ОписаниеСобытия.Вставить("ДатаНачала", ЗаписьПланЗанятий.ДатаНачала);
	ОписаниеСобытия.Вставить("ДатаОкончания", ЗаписьПланЗанятий.ДатаОкончания);
	ДБ_РаботаСКалендарем.ДобавитьСобытиеВКалендарьGoogle(ОписаниеСобытия);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
